src/cf/InformationRegisters/бпсПроксиСерверы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>бпсПроксиСерверы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОценкаРаботоспособности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/бпсПроксиСерверы/Ext/ManagerModule.bsl
Функция ПолучитьМассивНастроекПроксиСерверов() Экспорт
	
	МассивНастроекПроксиСерверов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 5
		|	бпсПроксиСерверы.Адрес,
		|	бпсПроксиСерверы.Порт,
		|	бпсПроксиСерверы.Логин,
		|	бпсПроксиСерверы.Пароль,
		|	бпсПроксиСерверы.ОценкаРаботоспособности КАК ОценкаРаботоспособности
		|ИЗ
		|	РегистрСведений.бпсПроксиСерверы КАК бпсПроксиСерверы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОценкаРаботоспособности УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НастройкиПроксиСтруктура = Новый Структура;
		НастройкиПроксиСтруктура.Вставить("Адрес");
		НастройкиПроксиСтруктура.Вставить("Порт");
		НастройкиПроксиСтруктура.Вставить("Логин");
		НастройкиПроксиСтруктура.Вставить("Пароль");
		ЗаполнитьЗначенияСвойств(НастройкиПроксиСтруктура, Выборка);
		МассивНастроекПроксиСерверов.Добавить(НастройкиПроксиСтруктура);
	КонецЦикла;
	
	Возврат МассивНастроекПроксиСерверов;
	
КонецФункции

Процедура ИзменитьОценкуРаботоспособностиПроксиСервера(АдресПрокси, ПортПрокси, ИзменениеОценки = 0) Экспорт

	Запись = РегистрыСведений.бпсПроксиСерверы.СоздатьМенеджерЗаписи();
    Запись.Адрес = АдресПрокси;
	Запись.Порт = ПортПрокси;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;	
	
	Запись.ОценкаРаботоспособности = Запись.ОценкаРаботоспособности + ИзменениеОценки;
	Запись.Записать();

КонецПроцедуры
